<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<%--test04_oper.jsp --%>

<%--EL 연산자--%>
<h3>\${7+5}=${7+5}</h3>
<h3>\${7-5}=${7-5}</h3>
<h3>\${7*5}=${7*5}</h3>
<h3>\${7/5}=${7/5}</h3>
<h3>\${7%5}=${7%5}</h3>

<%--
<h3>\${7 div 5}=${7 div 5}</h3>
<h3>\${7 mod 5}=${7 mod 5}</h3>
 --%>
 
<%
out.println(7/5);//몫
out.println("<br>");
out.println(7%5);//나머지
%>

<h2>관계 연산자</h2>
<h2>${7==5 }</h2>
<h2>${7!=5 }</h2>
<h2>${7>5 }</h2>
<h2>${7>=5 }</h2>
<h2>${7<5 }</h2>
<h2>${7<=5 }</h2>

<br>
<h3>${(5+3==8)?8:10 }</h3>

